# parameters
nc: 2  # number of classes
depth_multiple: 1.0  # dont change this otherwise InvertedResidual will be affected
width_multiple: 1.0  # dont change this otherwise InvertedResidual will be affected

# anchors
anchors:
  - [ 19,27,  44,40,  38,94 ]  # P3/8
  - [ 96,68,  86,152,  180,137 ]  # P4/16
  - [ 140,301,  303,264,  238,542 ]  # P5/32
  - [ 436,615,  739,380,  925,792 ]  # P6/64
# YOLOv5 backbone
backbone:
  # MobileNetV3-small
  # [from, number, module, args]
  [[-1, 1, Conv3BN, [16, 2]],                         # 0-p1/2
   [-1, 1, InvertedResidual, [16,  16, 3, 2, 1, 0]],  # 1-p2/4
   [-1, 1, InvertedResidual, [24,  72, 3, 2, 0, 0]],  # 2-p3/8
   [-1, 1, InvertedResidual, [24,  88, 3, 1, 0, 0]],  # 3-p3/8
   [-1, 1, InvertedResidual, [40,  96, 5, 2, 1, 1]],  # 4-p4/16
   [-1, 1, InvertedResidual, [40, 240, 5, 1, 1, 1]],  # 5-p4/16
   [-1, 1, InvertedResidual, [40, 240, 5, 1, 1, 1]],  # 6-p4/16
   [-1, 1, InvertedResidual, [48, 120, 5, 1, 1, 1]],  # 7-p4/16
   [-1, 1, InvertedResidual, [48, 144, 5, 1, 1, 1]],  # 8-p4/16
   [-1, 1, InvertedResidual, [96, 288, 5, 2, 1, 1]],  # 9-p5/32
   [-1, 1, InvertedResidual, [96, 576, 5, 1, 1, 1]],  # 10-p5/32
   [-1, 1, InvertedResidual, [96, 576, 5, 1, 1, 1]],  # 11-p5/32   
   [-1, 1, InvertedResidual, [192, 960, 5, 2, 1, 1]],  # 12-p6/64
   [-1, 1, InvertedResidual, [192, 960, 5, 1, 1, 1]],  # 13-p6/64
   [-1, 1, InvertedResidual, [192, 960, 5, 1, 1, 1]],  # 14-p6/64

  ]
        
# YOLOv5 head
# the head is still yolov5s, but depth_multiple and width_multiple are set to 1.0, so Conv and C3 need to be changed
# depth_multiple of yolov5s: 0.33, i.e., number of C3: 3 -> 1
# width_multiple of yolov5s: 0.50, i.e., halve the ch_out
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 11], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [256, False]],  # 18

   [-1, 1, Conv, [192, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [256, False]],  # 22 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [128, False]],  # 26 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 23], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3, [256, False]],  # 29 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [384, False]],  # 32 (P5/32-large)

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [512, False]],  # 36 (P5/32-large)

   [[26, 29, 32, 36], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
